---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallNominalThickness
source: html/65bf0659-7656-9c84-c183-234f367d0c63.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallNominalThickness Property

Represents wall nominal thickness of rectangle.

## Syntax (C#)
```csharp
public double WallNominalThickness { get; set; }
```

## Remarks
Nominal is measured real value of profile, should be thicker than designed.